In [119]:
import pandas as pd

****

**1. Sales Data Analysis Use Case**

In [120]:
sales_data = {
    "OrderID": [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    "CustomerID": ['C001', 'C002', 'C003', 'C004', 'C005', 'C006', 'C007', 'C008', 'C009', 'C010'],
    "CustomerName": [
        'Alice Johnson', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Segment": [
        'Consumer', 'Corporate', 'Home Office', 'Consumer', 'Corporate',
        'Consumer', 'Home Office', 'Consumer', 'Corporate', 'Consumer'
    ],
    "Region": [
        'East', 'West', 'Central', 'South', 'East',
        'Central', 'West', 'East', 'South', 'Central'
    ],
    "OrderDate": [
        '2025-08-01', '2025-08-03', '2025-08-05', '2025-08-07', '2025-08-09',
        '2025-08-11', '2025-08-13', '2025-08-15', '2025-08-17', '2025-08-19'
    ],
    "ProductCategory": [
        'Furniture', 'Office Supplies', 'Technology', 'Furniture', 'Office Supplies',
        'Technology', 'Furniture', 'Office Supplies', 'Technology', 'Furniture'
    ],
    "SalesAmount": [1200.50, 450.75, 890.00, 670.80, 310.25, 1500.00, 920.45, 540.60, 720.00, 1100.80],
    "Quantity": [2, 5, 1, 3, 4, 2, 1, 6, 3, 4],
    "Discount": [0.10, 0.05, 0.20, 0.15, 0.00, 0.25, 0.05, 0.10, 0.15, 0.20],
    "Profit": [300.12, 90.15, 150.50, 120.30, 70.40, 250.00, 200.10, 130.50, 180.00, 250.00],
    "SalesRep": [
        'William Clark', 'Olivia Martinez', 'James Wilson', 'Olivia Martinez', 'William Clark',
        'James Wilson', 'Olivia Martinez', 'William Clark', 'William Clark', 'Olivia Martinez'
    ]
}
data = pd.DataFrame(sales_data)
data

,OrderID,CustomerID,CustomerName,Segment,Region,OrderDate,ProductCategory,SalesAmount,Quantity,Discount,Profit,SalesRep
0,1001,C001,Alice Johnson,Consumer,East,2025-08-01,Furniture,1200.50,2,0.10,300.12,William Clark
1,1002,C002,Bob Smith,Corporate,West,2025-08-03,Office Supplies,450.75,5,0.05,90.15,Olivia Martinez
2,1003,C003,Carol Lee,Home Office,Central,2025-08-05,Technology,890.00,1,0.20,150.50,James Wilson
3,1004,C004,David Kim,Consumer,South,2025-08-07,Furniture,670.80,3,0.15,120.30,Olivia Martinez
4,1005,C005,Emma Davis,Corporate,East,2025-08-09,Office Supplies,310.25,4,0.00,70.40,William Clark
5,1006,C006,Frank Wilson,Consumer,Central,2025-08-11,Technology,1500.00,2,0.25,250.00,James Wilson
6,1007,C007,Grace Chen,Home Office,West,2025-08-13,Furniture,920.45,1,0.05,200.10,Olivia Martinez
7,1008,C008,Henry Patel,Consumer,East,2025-08-15,Office Supplies,540.60,6,0.10,130.50,William Clark
8,1009,C009,Irene Lopez,Corporate,South,2025-08-17,Technology,720.00,3,0.15,180.00,William Clark
9,1010,C010,Jack Brown,Consumer,Central,2025-08-19,Furniture,1100.80,4,0.20,250.00,Olivia Martinez

Count total sales per product category

In [121]:
data.groupby("ProductCategory")["OrderID"].count()

ProductCategory
Furniture          4
Office Supplies    3
Technology         3
Name: OrderID, dtype: int64

Calculate the total revenue generated by each sales representative.

In [122]:
data.groupby('SalesRep')['Profit'].sum()

SalesRep
James Wilson       400.50
Olivia Martinez    660.55
William Clark      681.02
Name: Profit, dtype: float64

Find the product with the highest sales.

In [123]:
data.iloc[data['Quantity'].idxmax()]['ProductCategory']

'Office Supplies'

Group data by sales regions and calculate average sales.

In [124]:
data['product_of_two'] = data['Profit']*data['Quantity']###
data.groupby('Region')['product_of_two'].mean()

data.groupby('Region')['SalesAmount'].mean()

Region
Central    1163.600000
East        683.783333
South       695.400000
West        685.600000
Name: SalesAmount, dtype: float64

---
**2. Employee Data Analysis Use Case**

In [125]:
employee_data_dict = {
    "EmployeeID": ['E001','E002','E003','E004','E005','E006','E007','E008','E009','E010'],
    "Name": [
        'Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Department": [
        'HR', 'IT', 'Finance', 'IT', 'Marketing',
        'HR', 'Finance', 'Marketing', 'IT', 'HR'
    ],
    "Salary": [55000, 72000, 68000, 75000, 50000, 53000, 67000, 52000, 71000, 56000],
    "PerformanceScore": [8.5, 7.2, 9.0, 6.5, 8.0, 7.8, 8.9, 7.5, 9.3, 6.8]
}
data = pd.DataFrame(employee_data_dict)
data

  EmployeeID          Name Department  Salary  PerformanceScore
0       E001   Alice Brown         HR   55000               8.5
1       E002     Bob Smith         IT   72000               7.2
2       E003     Carol Lee    Finance   68000               9.0
3       E004     David Kim         IT   75000               6.5
4       E005    Emma Davis  Marketing   50000               8.0
5       E006  Frank Wilson         HR   53000               7.8
6       E007    Grace Chen    Finance   67000               8.9
7       E008   Henry Patel  Marketing   52000               7.5
8       E009   Irene Lopez         IT   71000               9.3
9       E010    Jack Brown         HR   56000               6.8

• Count the number of employees per department

In [126]:
data.groupby('Department')['EmployeeID'].count()

Department
Finance      2
HR           3
IT           3
Marketing    2
Name: EmployeeID, dtype: int64

• Find the employee with the highest salary.

In [127]:
data.iloc[data['Salary'].idxmax()]

EmployeeID               E004
Name                David Kim
Department                 IT
Salary                  75000
PerformanceScore          6.5
Name: 3, dtype: object

• Calculate average salary per department.

In [128]:
data.groupby('Department')['Salary'].mean()

Department
Finance      67500.000000
HR           54666.666667
IT           72666.666667
Marketing    51000.000000
Name: Salary, dtype: float64

Sort employees based on their performance score or salary

In [129]:
data.sort_values('PerformanceScore')

  EmployeeID          Name Department  Salary  PerformanceScore
3       E004     David Kim         IT   75000               6.5
9       E010    Jack Brown         HR   56000               6.8
1       E002     Bob Smith         IT   72000               7.2
7       E008   Henry Patel  Marketing   52000               7.5
5       E006  Frank Wilson         HR   53000               7.8
4       E005    Emma Davis  Marketing   50000               8.0
0       E001   Alice Brown         HR   55000               8.5
6       E007    Grace Chen    Finance   67000               8.9
2       E003     Carol Lee    Finance   68000               9.0
8       E009   Irene Lopez         IT   71000               9.3

----
**3. Student Performance Analysis Use Case**

In [130]:
student_data_dict = {
    "StudentID": ['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008', 'S009', 'S010'],
    "Name": [
        'Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis',
        'Frank Wilson', 'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown'
    ],
    "Math": [85, 58, 95, 76, 66, 90, 72, 81, 69, 88],
    "Science": [78, 64, 18, 85, 72, 95, 10, 79, 14, 10],
    "English": [92, 10, 82, 20, 68, 88, 75, 85, 17, 86],
    "History": [74, 66, 91, 79, 70, 92, 65, 80, 71, 19],
    "Class": ['Class A', 'Class A', 'Class B', 'Class B', 'Class A', 'Class C', 'Class C', 'Class B', 'Class A', 'Class C']
}
data = pd.DataFrame(student_data_dict)
data

  StudentID          Name  Math  Science  English  History    Class
0      S001   Alice Brown    85       78       92       74  Class A
1      S002     Bob Smith    58       64       10       66  Class A
2      S003     Carol Lee    95       18       82       91  Class B
3      S004     David Kim    76       85       20       79  Class B
4      S005    Emma Davis    66       72       68       70  Class A
5      S006  Frank Wilson    90       95       88       92  Class C
6      S007    Grace Chen    72       10       75       65  Class C
7      S008   Henry Patel    81       79       85       80  Class B
8      S009   Irene Lopez    69       14       17       71  Class A
9      S010    Jack Brown    88       10       86       19  Class C

In [131]:
data['total'] = data.iloc[:,2:-1].sum(axis=1)

• Count the number of students per class/grade.

In [132]:
data.groupby('Class')['StudentID'].count()

Class
Class A    4
Class B    3
Class C    3
Name: StudentID, dtype: int64

• Calculate the average marks per subject.

In [133]:
data.iloc[:,2:-2].mean(axis=0)

Math       78.0
Science    52.5
English    62.3
History    70.7
dtype: float64

• Find the student with the highest overall score.

In [134]:
data.iloc[data['total'].idxmax()]

StudentID            S006
Name         Frank Wilson
Math                   90
Science                95
English                88
History                92
Class             Class C
total                 365
Name: 5, dtype: object

• Identify students who scored below the passing mark in any subject.

In [135]:
data[(data.iloc[:,2:-2]<40).any(axis=1)]

  StudentID         Name  Math  Science  English  History    Class  total
1      S002    Bob Smith    58       64       10       66  Class A    198
2      S003    Carol Lee    95       18       82       91  Class B    286
3      S004    David Kim    76       85       20       79  Class B    260
6      S007   Grace Chen    72       10       75       65  Class C    222
8      S009  Irene Lopez    69       14       17       71  Class A    171
9      S010   Jack Brown    88       10       86       19  Class C    203

---
**4. E-commerce Orders Analysis Use Case**

In [136]:
import pandas as pd

ecommerce_orders_dict = {
    "OrderID": list(range(101, 121)),
    "CustomerID": ['C001', 'C002', 'C003', 'C001', 'C004', 'C005', 'C002', 'C003', 'C001', 'C004',
                   'C005', 'C006', 'C007', 'C008', 'C001', 'C002', 'C003', 'C006', 'C007', 'C008'],
    "CustomerName": ['Alice', 'Bob', 'Carol', 'Alice', 'David', 'Emma', 'Bob', 'Carol', 'Alice', 'David',
                     'Emma', 'Frank', 'Grace', 'Henry', 'Alice', 'Bob', 'Carol', 'Frank', 'Grace', 'Henry'],
    "Product": ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Laptop', 'Mouse', 'Laptop', 'Keyboard', 'Mouse', 'Monitor',
                'Keyboard', 'Headphones', 'Smartphone', 'Tablet', 'Laptop', 'Headphones', 'Keyboard', 'Smartphone', 'Tablet', 'Monitor'],
    "Quantity": [1, 2, 1, 1, 2, 3, 1, 2, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 2, 1],
    "Price": [1200, 25, 45, 200, 1150, 20, 1250, 50, 25, 210, 45, 100, 800, 400, 1300, 100, 50, 750, 420, 210]
}

data = pd.DataFrame(ecommerce_orders_dict)
data

    OrderID CustomerID CustomerName     Product  Quantity  Price
0       101       C001        Alice      Laptop         1   1200
1       102       C002          Bob       Mouse         2     25
2       103       C003        Carol    Keyboard         1     45
3       104       C001        Alice     Monitor         1    200
4       105       C004        David      Laptop         2   1150
5       106       C005         Emma       Mouse         3     20
6       107       C002          Bob      Laptop         1   1250
7       108       C003        Carol    Keyboard         2     50
8       109       C001        Alice       Mouse         1     25
9       110       C004        David     Monitor         1    210
10      111       C005         Emma    Keyboard         2     45
11      112       C006        Frank  Headphones         1    100
12      113       C007        Grace  Smartphone         1    800
13      114       C008        Henry      Tablet         1    400
14      115       C001        Alice      Laptop         1   1300
15      116       C002          Bob  Headphones         2    100
16      117       C003        Carol    Keyboard         1     50
17      118       C006        Frank  Smartphone         1    750
18      119       C007        Grace      Tablet         2    420
19      120       C008        Henry     Monitor         1    210

• Count total orders per customer.

In [137]:
data.groupby('CustomerID')['OrderID'].count()

CustomerID
C001    4
C002    3
C003    3
C004    2
C005    2
C006    2
C007    2
C008    2
Name: OrderID, dtype: int64

• Find the customer who placed the highest number of orders.

In [138]:
data.groupby('CustomerName')['Quantity'].count().idxmax()

'Alice'

• Calculate revenue generated per product.

In [139]:
data['totalamount'] = data['Quantity']*data['Price']

In [140]:
data.groupby('Product')['totalamount'].sum()

Product
Headphones     300
Keyboard       285
Laptop        6050
Monitor        620
Mouse          135
Smartphone    1550
Tablet        1240
Name: totalamount, dtype: int64

• Identify the top 5 selling products.

In [141]:
data.groupby('Product')['Quantity'].sum().sort_values(ascending=False)[0:5]

Product
Keyboard      6
Mouse         6
Laptop        5
Headphones    3
Monitor       3
Name: Quantity, dtype: int64

---
**5. Hospital Patient Records Analysis Use Case**

In [142]:
import pandas as pd

hospital_data_dict = {
    "PatientID": ['P001', 'P002', 'P003', 'P004', 'P005', 'P006', 'P007', 'P008', 'P009', 'P010', 'P011', 'P012'],
    "PatientName": ['Alice Brown', 'Bob Smith', 'Carol Lee', 'David Kim', 'Emma Davis', 'Frank Wilson', 
                    'Grace Chen', 'Henry Patel', 'Irene Lopez', 'Jack Brown', 'Laura White', 'Mike Green'],
    "Department": ['Cardiology', 'Neurology', 'Orthopedics', 'Cardiology', 'Pediatrics', 'Neurology', 
                   'Orthopedics', 'Cardiology', 'Pediatrics', 'Neurology', 'Orthopedics', 'Cardiology'],
    "AdmissionDate": ['2025-01-05', '2025-01-10', '2025-02-15', '2025-03-01', '2025-03-05', '2025-04-12', 
                      '2025-04-20', '2025-05-03', '2025-05-10', '2025-06-15', '2025-06-20', '2025-07-01'],
    "DischargeDate": ['2025-01-12', '2025-01-20', '2025-02-25', '2025-03-10', '2025-03-12', '2025-04-22', 
                      '2025-04-28', '2025-05-10', '2025-05-15', '2025-06-25', '2025-06-28', '2025-07-10'],
    "HospitalStayDays": [7, 10, 10, 9, 7, 10, 8, 7, 5, 10, 8, 9]
}

data = pd.DataFrame(hospital_data_dict)
data

,PatientID,PatientName,Department,AdmissionDate,DischargeDate,HospitalStayDays
0,P001,Alice Brown,Cardiology,2025-01-05,2025-01-12,7
1,P002,Bob Smith,Neurology,2025-01-10,2025-01-20,10
2,P003,Carol Lee,Orthopedics,2025-02-15,2025-02-25,10
3,P004,David Kim,Cardiology,2025-03-01,2025-03-10,9
4,P005,Emma Davis,Pediatrics,2025-03-05,2025-03-12,7
5,P006,Frank Wilson,Neurology,2025-04-12,2025-04-22,10
6,P007,Grace Chen,Orthopedics,2025-04-20,2025-04-28,8
7,P008,Henry Patel,Cardiology,2025-05-03,2025-05-10,7
8,P009,Irene Lopez,Pediatrics,2025-05-10,2025-05-15,5
9,P010,Jack Brown,Neurology,2025-06-15,2025-06-25,10
10,P011,Laura White,Orthopedics,2025-06-20,2025-06-28,8
11,P012,Mike Green,Cardiology,2025-07-01,2025-07-10,9

**Count the number of patients per department.**

In [143]:
data.groupby('Department')['PatientID'].count()

Department
Cardiology     4
Neurology      3
Orthopedics    3
Pediatrics     2
Name: PatientID, dtype: int64

• Find the average hospital stay duration per department.

In [144]:

data['AdmissionDate'] = pd.to_datetime(data['AdmissionDate'])
data.groupby('Department')['HospitalStayDays'].mean().round(1)

Department
Cardiology      8.0
Neurology      10.0
Orthopedics     8.7
Pediatrics      6.0
Name: HospitalStayDays, dtype: float64

• Identify the patient with the longest hospital stay.

In [145]:
data.iloc[data['HospitalStayDays'].idxmax()]['PatientName']

'Bob Smith'

• Calculate the number of patients admitted per month.

In [146]:
data.groupby(data['AdmissionDate'].dt.to_period('M'))['PatientID'].count()####

AdmissionDate
2025-01    2
2025-02    1
2025-03    2
2025-04    2
2025-05    2
2025-06    2
2025-07    1
Freq: M, Name: PatientID, dtype: int64

---
**6. Banking Transactions Analysis Use Case**

In [147]:
bank_transactions_dict = {
    "TransactionID": ['T001', 'T002', 'T003', 'T004', 'T005', 'T006', 'T007', 'T008', 'T009', 'T010', 'T011', 'T012'],
    "AccountID": ['A001', 'A002', 'A001', 'A003', 'A002', 'A001', 'A004', 'A003', 'A004', 'A002', 'A003', 'A001'],
    "CustomerName": ['Alice', 'Bob', 'Alice', 'Carol', 'Bob', 'Alice', 'David', 'Carol', 'David', 'Bob', 'Carol', 'Alice'],
    "TransactionType": ['Deposit', 'Withdrawal', 'Deposit', 'Deposit', 'Withdrawal', 'Withdrawal', 'Deposit', 'Withdrawal', 'Deposit', 'Deposit', 'Withdrawal', 'Deposit'],
    "TransactionAmount": [1200, 500, 1500, 2000, 700, 600, 3000, 1000, 2500, 1200, 800, 1800],
    "TransactionDate": ['2025-01-05', '2025-01-07', '2025-01-10', '2025-02-01', '2025-02-05', '2025-02-10',
                        '2025-03-03', '2025-03-10', '2025-03-15', '2025-04-01', '2025-04-05', '2025-04-10']
}
data = pd.DataFrame(bank_transactions_dict)
data

,TransactionID,AccountID,CustomerName,TransactionType,TransactionAmount,TransactionDate
0,T001,A001,Alice,Deposit,1200,2025-01-05
1,T002,A002,Bob,Withdrawal,500,2025-01-07
2,T003,A001,Alice,Deposit,1500,2025-01-10
3,T004,A003,Carol,Deposit,2000,2025-02-01
4,T005,A002,Bob,Withdrawal,700,2025-02-05
5,T006,A001,Alice,Withdrawal,600,2025-02-10
6,T007,A004,David,Deposit,3000,2025-03-03
7,T008,A003,Carol,Withdrawal,1000,2025-03-10
8,T009,A004,David,Deposit,2500,2025-03-15
9,T010,A002,Bob,Deposit,1200,2025-04-01
10,T011,A003,Carol,Withdrawal,800,2025-04-05
11,T012,A001,Alice,Deposit,1800,2025-04-10

• Count the total number of transactions per account.

In [148]:
data.groupby('AccountID')['TransactionID'].count()

AccountID
A001    4
A002    3
A003    3
A004    2
Name: TransactionID, dtype: int64

• Find the account with the highest transaction value.

In [149]:
data.iloc[data['TransactionAmount'].idxmax()]

TransactionID              T007
AccountID                  A004
CustomerName              David
TransactionType         Deposit
TransactionAmount          3000
TransactionDate      2025-03-03
Name: 6, dtype: object

• Calculate average transaction amount per customer.

In [150]:
data.groupby('AccountID')['TransactionAmount'].mean()

AccountID
A001    1275.000000
A002     800.000000
A003    1266.666667
A004    2750.000000
Name: TransactionAmount, dtype: float64

• Group transactions by type (deposit, withdrawal) and calculate totals.

In [151]:
data.groupby('TransactionType')['TransactionAmount'].sum()

TransactionType
Deposit       13200
Withdrawal     3600
Name: TransactionAmount, dtype: int64

---
**7. Retail Store Inventory Analysis Use Case**

In [152]:
inventory_dict = {
    "ProductID": ['P001','P002','P003','P004','P005','P006','P007','P008','P009','P010'],
    "Category": ['Beverages','Beverages','Snacks','Snacks','Dairy','Dairy','Bakery','Bakery','Household','Household'],
    "ProductName": [
        'Cola 500ml', 'Orange Juice 1L', 'Potato Chips 200g', 'Chocolate Bar 50g',
        'Milk 1L', 'Cheddar Cheese 200g', 'Whole Wheat Bread', 'Croissant Pack (4)',
        'Laundry Detergent 2kg', 'Dish Soap 500ml'
    ],
    "Stock": [120, 45, 80, 25, 60, 15, 35, 10, 90, 50],
    "ReorderLevel": [50, 60, 40, 30, 40, 20, 25, 15, 30, 20]
}
data = pd.DataFrame(inventory_dict)
data

  ProductID   Category            ProductName  Stock  ReorderLevel
0      P001  Beverages             Cola 500ml    120            50
1      P002  Beverages        Orange Juice 1L     45            60
2      P003     Snacks      Potato Chips 200g     80            40
3      P004     Snacks      Chocolate Bar 50g     25            30
4      P005      Dairy                Milk 1L     60            40
5      P006      Dairy    Cheddar Cheese 200g     15            20
6      P007     Bakery      Whole Wheat Bread     35            25
7      P008     Bakery     Croissant Pack (4)     10            15
8      P009  Household  Laundry Detergent 2kg     90            30
9      P010  Household        Dish Soap 500ml     50            20

• Count the number of products in each category.

In [153]:
data.groupby('Category')['ProductID'].count()

Category
Bakery       2
Beverages    2
Dairy        2
Household    2
Snacks       2
Name: ProductID, dtype: int64

• Find the product with the lowest stock quantity.

In [154]:
data.iloc[data['Stock'].idxmin()]['ProductName']

'Croissant Pack (4)'

• Calculate the average stock value per category.

In [155]:
data.groupby('Category')["Stock"].mean()

Category
Bakery       22.5
Beverages    82.5
Dairy        37.5
Household    70.0
Snacks       52.5
Name: Stock, dtype: float64

• Identify products that need restocking (below threshold = 60).

In [156]:
print(data[(data['Stock']<30)])

  ProductID Category          ProductName  Stock  ReorderLevel
3      P004   Snacks    Chocolate Bar 50g     25            30
5      P006    Dairy  Cheddar Cheese 200g     15            20
7      P008   Bakery   Croissant Pack (4)     10            15

---
**8. Social Media Engagement Analysis Use Case**

In [157]:

social_media_data = {
    "PostID": ['P001','P002','P003','P004','P005','P006','P007','P008','P009','P010','P011','P012'],
    "UserID": ['U001','U002','U001','U003','U002','U001','U004','U003','U004','U001','U002','U003'],
    "UserName": ['Alice','Bob','Alice','Carol','Bob','Alice','David','Carol','David','Alice','Bob','Carol'],
    "PostContent": [
        'Had a great day!', 'Check out this photo!', 'New blog post is up', 'Lovely sunset!',
        'Weekend vibes', 'Sharing a tip', 'Throwback Thursday', 'Morning coffee', 'Fitness update',
        'Book recommendation', 'Holiday photos', 'Movie review'
    ],
    "Likes": [120, 85, 150, 200, 90, 130, 50, 110, 75, 160, 95, 180],
    "Comments": [15, 10, 25, 30, 8, 20, 5, 12, 4, 18, 9, 22],
    "PostDate": [
        '2025-08-01','2025-08-02','2025-08-03','2025-08-04','2025-08-05','2025-08-06',
        '2025-08-07','2025-08-08','2025-08-09','2025-08-10','2025-08-11','2025-08-12'
    ]
}

data = pd.DataFrame(social_media_data)
data

   PostID UserID UserName            PostContent  Likes  Comments    PostDate
0    P001   U001    Alice       Had a great day!    120        15  2025-08-01
1    P002   U002      Bob  Check out this photo!     85        10  2025-08-02
2    P003   U001    Alice    New blog post is up    150        25  2025-08-03
3    P004   U003    Carol         Lovely sunset!    200        30  2025-08-04
4    P005   U002      Bob          Weekend vibes     90         8  2025-08-05
5    P006   U001    Alice          Sharing a tip    130        20  2025-08-06
6    P007   U004    David     Throwback Thursday     50         5  2025-08-07
7    P008   U003    Carol         Morning coffee    110        12  2025-08-08
8    P009   U004    David         Fitness update     75         4  2025-08-09
9    P010   U001    Alice    Book recommendation    160        18  2025-08-10
10   P011   U002      Bob         Holiday photos     95         9  2025-08-11
11   P012   U003    Carol           Movie review    180        22  2025-08-12

• Count the number of posts per user.

In [158]:
data.groupby('UserID')['PostID'].count()

UserID
U001    4
U002    3
U003    3
U004    2
Name: PostID, dtype: int64

• Find the post with the highest number of likes or comments.

In [159]:
data.iloc[data['Likes'].idxmax()]['UserName']

'Carol'

• Calculate average likes per user.

In [160]:
data.groupby('UserID')['Likes'].mean()

UserID
U001    140.000000
U002     90.000000
U003    163.333333
U004     62.500000
Name: Likes, dtype: float64

• Identify the most active users based on posting frequency.

In [161]:
data.groupby('UserID')['PostID'].count().idxmax()

'U001'

---
**9. Airline Flight Data Analysis Use Case**

In [162]:
flight_data = {
    "FlightID": ['F001','F002','F003','F004','F005','F006','F007','F008','F009','F010','F011','F012'],
    "Airline": ['AirAlpha','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha','AirGamma','AirBeta','AirAlpha'],
    "Origin": ['New York','Los Angeles','New York','Chicago','Los Angeles','New York','Chicago','Los Angeles','New York','Chicago','Los Angeles','New York'],
    "Destination": ['Chicago','New York','Chicago','New York','Chicago','Miami','Miami','Miami','Miami','Miami','Miami','Miami'],
    "DepartureTime": ['2025-08-01 08:00','2025-08-01 09:00','2025-08-02 10:00','2025-08-02 12:00',
                      '2025-08-03 14:00','2025-08-03 16:00','2025-08-04 08:00','2025-08-04 09:00',
                      '2025-08-05 10:00','2025-08-05 12:00','2025-08-06 14:00','2025-08-06 16:00'],
    "ArrivalTime": ['2025-08-01 11:00','2025-08-01 13:00','2025-08-02 13:00','2025-08-02 15:30',
                    '2025-08-03 17:00','2025-08-03 19:30','2025-08-04 11:30','2025-08-04 12:45',
                    '2025-08-05 13:00','2025-08-05 15:30','2025-08-06 17:30','2025-08-06 18:45'],
    "FlightDurationMinutes": [180, 240, 180, 210, 180, 210, 210, 225, 180, 210, 210, 165],
    "DelayMinutes": [15, 30, 0, 10, 5, 20, 15, 0, 25, 5, 10, 0]
}
data = pd.DataFrame(flight_data)
data

,FlightID,Airline,Origin,Destination,DepartureTime,ArrivalTime,FlightDurationMinutes,DelayMinutes
0,F001,AirAlpha,New York,Chicago,2025-08-01 08:00,2025-08-01 11:00,180,15
1,F002,AirBeta,Los Angeles,New York,2025-08-01 09:00,2025-08-01 13:00,240,30
2,F003,AirAlpha,New York,Chicago,2025-08-02 10:00,2025-08-02 13:00,180,0
3,F004,AirGamma,Chicago,New York,2025-08-02 12:00,2025-08-02 15:30,210,10
4,F005,AirBeta,Los Angeles,Chicago,2025-08-03 14:00,2025-08-03 17:00,180,5
5,F006,AirAlpha,New York,Miami,2025-08-03 16:00,2025-08-03 19:30,210,20
6,F007,AirGamma,Chicago,Miami,2025-08-04 08:00,2025-08-04 11:30,210,15
7,F008,AirBeta,Los Angeles,Miami,2025-08-04 09:00,2025-08-04 12:45,225,0
8,F009,AirAlpha,New York,Miami,2025-08-05 10:00,2025-08-05 13:00,180,25
9,F010,AirGamma,Chicago,Miami,2025-08-05 12:00,2025-08-05 15:30,210,5
10,F011,AirBeta,Los Angeles,Miami,2025-08-06 14:00,2025-08-06 17:30,210,10
11,F012,AirAlpha,New York,Miami,2025-08-06 16:00,2025-08-06 18:45,165,0

• Count the number of flights per airline.

In [163]:
data.groupby('Airline')['FlightID'].count()

Airline
AirAlpha    5
AirBeta     4
AirGamma    3
Name: FlightID, dtype: int64

• Calculate average flight delay per airline.

In [164]:
data.groupby('Airline')['DelayMinutes'].mean()

Airline
AirAlpha    12.00
AirBeta     11.25
AirGamma    10.00
Name: DelayMinutes, dtype: float64

• Identify the route with the maximum number of flights.

In [165]:
data.groupby("Destination")['FlightID'].count().idxmax()

'Miami'

• Find the longest and shortest flight duration.

In [166]:
print(data.iloc[data['FlightDurationMinutes'].idxmax()]['Destination'])
print(data.iloc[data['FlightDurationMinutes'].idxmin()]['Destination'])

New York
Miami

---
**10. Movie Ratings Analysis Use Case**

In [167]:

movie_ratings_data = {
    "MovieID": [
        'M001','M001','M002','M002','M003','M003','M004','M004','M005','M005',
        'M006','M006','M007','M007','M008','M008','M009','M009','M010','M010',
        'M011','M011','M012','M012','M013','M013','M014','M014','M015','M015'
    ],
    "Title": [
        'The Adventure','The Adventure','Space Journey','Space Journey','Mystery Night','Mystery Night',
        'Love in Paris','Love in Paris','Tech Revolution','Tech Revolution','Hidden Secrets','Hidden Secrets',
        'Comedy Club','Comedy Club','Horror House','Horror House','Drama Tales','Drama Tales','Fantasy World','Fantasy World',
        'Sci-Fi Saga','Sci-Fi Saga','Romantic Escape','Romantic Escape','Thriller Night','Thriller Night','Action Blast','Action Blast','Family Fun','Family Fun'
    ],
    "Genre": [
        'Adventure','Adventure','Sci-Fi','Sci-Fi','Mystery','Mystery','Romance','Romance','Sci-Fi','Sci-Fi',
        'Mystery','Mystery','Comedy','Comedy','Horror','Horror','Drama','Drama','Fantasy','Fantasy',
        'Sci-Fi','Sci-Fi','Romance','Romance','Thriller','Thriller','Action','Action','Family','Family'
    ],
    "Director": [
        'John Smith','John Smith','Alice Brown','Alice Brown','Carol Lee','Carol Lee','David Kim','David Kim',
        'Alice Brown','Alice Brown','Carol Lee','Carol Lee','Emma Davis','Emma Davis','Frank Wilson','Frank Wilson',
        'Grace Chen','Grace Chen','Henry Patel','Henry Patel','Alice Brown','Alice Brown','David Kim','David Kim',
        'Carol Lee','Carol Lee','Emma Davis','Emma Davis','Grace Chen','Grace Chen'
    ],
    "Rating": [
        8.5, 8.8, 9.2, 8.9, 7.8, 8.0, 8.0, 7.9, 9.0, 9.1, 8.1, 7.9, 7.5, 7.8, 6.8, 7.0, 8.3, 8.4, 9.1, 9.0,
        9.3, 9.0, 8.2, 8.1, 7.7, 8.0, 8.5, 8.3, 7.9, 8.1
    ]
}


data = pd.DataFrame(movie_ratings_data)
data

   MovieID            Title      Genre      Director  Rating
0     M001    The Adventure  Adventure    John Smith     8.5
1     M001    The Adventure  Adventure    John Smith     8.8
2     M002    Space Journey     Sci-Fi   Alice Brown     9.2
3     M002    Space Journey     Sci-Fi   Alice Brown     8.9
4     M003    Mystery Night    Mystery     Carol Lee     7.8
5     M003    Mystery Night    Mystery     Carol Lee     8.0
6     M004    Love in Paris    Romance     David Kim     8.0
7     M004    Love in Paris    Romance     David Kim     7.9
8     M005  Tech Revolution     Sci-Fi   Alice Brown     9.0
9     M005  Tech Revolution     Sci-Fi   Alice Brown     9.1
10    M006   Hidden Secrets    Mystery     Carol Lee     8.1
11    M006   Hidden Secrets    Mystery     Carol Lee     7.9
12    M007      Comedy Club     Comedy    Emma Davis     7.5
13    M007      Comedy Club     Comedy    Emma Davis     7.8
14    M008     Horror House     Horror  Frank Wilson     6.8
15    M008     Horror House     Horror  Frank Wilson     7.0
16    M009      Drama Tales      Drama    Grace Chen     8.3
17    M009      Drama Tales      Drama    Grace Chen     8.4
18    M010    Fantasy World    Fantasy   Henry Patel     9.1
19    M010    Fantasy World    Fantasy   Henry Patel     9.0
20    M011      Sci-Fi Saga     Sci-Fi   Alice Brown     9.3
21    M011      Sci-Fi Saga     Sci-Fi   Alice Brown     9.0
22    M012  Romantic Escape    Romance     David Kim     8.2
23    M012  Romantic Escape    Romance     David Kim     8.1
24    M013   Thriller Night   Thriller     Carol Lee     7.7
25    M013   Thriller Night   Thriller     Carol Lee     8.0
26    M014     Action Blast     Action    Emma Davis     8.5
27    M014     Action Blast     Action    Emma Davis     8.3
28    M015       Family Fun     Family    Grace Chen     7.9
29    M015       Family Fun     Family    Grace Chen     8.1

• Count the number of movies per genre.

In [168]:
data.groupby('Genre')['MovieID'].count()

Genre
Action       2
Adventure    2
Comedy       2
Drama        2
Family       2
Fantasy      2
Horror       2
Mystery      4
Romance      4
Sci-Fi       6
Thriller     2
Name: MovieID, dtype: int64

• Calculate the average rating per movie.

In [169]:
data.groupby('MovieID')['Rating'].mean()

MovieID
M001    8.65
M002    9.05
M003    7.90
M004    7.95
M005    9.05
M006    8.00
M007    7.65
M008    6.90
M009    8.35
M010    9.05
M011    9.15
M012    8.15
M013    7.85
M014    8.40
M015    8.00
Name: Rating, dtype: float64

• Find the movie with the highest rating.

In [170]:
data.iloc[data['Rating'].idxmax()]['Title']

'Sci-Fi Saga'

• Identify top 5 directors based on average movie ratings.

In [171]:
data.groupby("Director")['Rating'].mean()

Director
Alice Brown     9.083333
Carol Lee       7.916667
David Kim       8.050000
Emma Davis      8.025000
Frank Wilson    6.900000
Grace Chen      8.175000
Henry Patel     9.050000
John Smith      8.650000
Name: Rating, dtype: float64

---
**Pandas Treasure Hunt: The Hidden Wealth of Vijayanagara**

It is the 16th century. The Vijayanagara Empire thrives, with bustling bazaars, grand gopurams, and far-reaching trade in spices, silk, and gems. Rumors whisper that King Krishnadevaraya hid a treasure of knowledge and wealth in secret chambers beneath Hampi. The treasure can only be revealed by solving 20 data scrolls preserved by scholars, merchants, and temple priests. You are a young data explorer chosen to decode these scrolls using pandas, traveling across the empire, solving puzzles, and uncovering secrets. Each solved scroll brings you closer to the treasure.

In [172]:
families = ["Sangama", "Saluva", "Tuluva", "Aravindu","Vijaya","Rama","Hari","Deva","Vira", "Chandra"]
tributes = [5000, 4200, 4800, 5100, 4700,4500,4200,4600,4900,4400]
tribute_series = pd.Series(data=tributes, index=families, name="Tribute")
print("Series:\n", tribute_series, "\n")

Series:
 Sangama     5000
Saluva      4200
Tuluva      4800
Aravindu    5100
Vijaya      4700
Rama        4500
Hari        4200
Deva        4600
Vira        4900
Chandra     4400
Name: Tribute, dtype: int64

Scene 1:

 The Royal Decree of Hampi As you enter the palace, the royal librarian hands you a scroll listing noble families and their tribute. Some names are written in old Kannada script, and some tribute values seem oddly high.

Task: Create a Series and DataFrame with family names and tribute amounts.

 Use the family names as the index. (Concept: Series/DataFrame creation + custom index)

Scene 2:

 The Hampi Bazaar The largest market dazzles with diamonds, horses, spices, and silk. Merchants shout their prices, and you need to find only the stalls selling precious items.

 Task: Slice the DataFrame to show only the first 10 rows and last 5 rows. (Concept: Indexing & slicing)

In [173]:
import pandas as pd

import pandas as pd

# Corrected mock DataFrame
data = {
    "Merchant": [f"Merchant_{i}" for i in range(1, 31)],
    "Item": [
        "Gold","Diamond","Gold","Horse","Spices","Gold","Diamond","Silk","Gold","Diamond",
        "Diamond","Diamond","Silk","Horse","Spices","Gold","Horse","Diamond","Silk","Horse",
        "Spices","Gold","Silk","Silk","Gold","Spices","Horse","Gold","Diamond","Gold"
    ],
    "Price": [
        2970,17552,30984,47965,26610,12397,38861,40106,29126,25728,
        15406,7470,28742,42008,38352,24878,9986,26779,10751,37558,
        21604,36990,35766,2419,35817,49043,20236,27408,35786,11673
    ]
}

bazaar_df = pd.DataFrame(data)

# Show first 10 rows
first_10 = bazaar_df.head(10)

# Show last 5 rows
last_5 = bazaar_df.tail(5)

print("First 10 stalls:\n", first_10, "\n")
print("Last 5 stalls:\n", last_5)

First 10 stalls:
       Merchant     Item  Price
0   Merchant_1     Gold   2970
1   Merchant_2  Diamond  17552
2   Merchant_3     Gold  30984
3   Merchant_4    Horse  47965
4   Merchant_5   Spices  26610
5   Merchant_6     Gold  12397
6   Merchant_7  Diamond  38861
7   Merchant_8     Silk  40106
8   Merchant_9     Gold  29126
9  Merchant_10  Diamond  25728

Last 5 stalls:
        Merchant     Item  Price
25  Merchant_26   Spices  49043
26  Merchant_27    Horse  20236
27  Merchant_28     Gold  27408
28  Merchant_29  Diamond  35786
29  Merchant_30     Gold  11673

Scene 3: The Palace Guard’s Riddle A guard stops you at the inner sanctum. “Who brings tribute from the House of Saluva?” he demands. Only by presenting the right record can you pass.

Task: Use .loc to fetch rows where House == “Saluva”. Handle cases where multiple entries exist. (Concept: Label-based indexing + handling duplicates)

In [174]:
import pandas as pd

families = ["Sangama", "Saluva", "Tuluva", "Aravindu",
            "Vijaya", "Rama", "Hari", "Deva", "Vira", "Chandra"]

tributes = [5000, 4200, 4800, 5100, 4700,
            4500, 4200, 4600, 4900, 4400]

# Create DataFrame
tribute_df = pd.DataFrame({
    "House": families,
    "Tribute": tributes
})

print("All Tribute Records:\n", tribute_df, "\n")

# Guard’s question: Fetch all rows where House == "Saluva"
saluvan_records = tribute_df.loc[tribute_df["House"] == "Saluva"]

print("Guard’s Riddle - Tribute from House of Saluva:\n", saluvan_records)

All Tribute Records:
       House  Tribute
0   Sangama     5000
1    Saluva     4200
2    Tuluva     4800
3  Aravindu     5100
4    Vijaya     4700
5      Rama     4500
6      Hari     4200
7      Deva     4600
8      Vira     4900
9   Chandra     4400

Guard’s Riddle - Tribute from House of Saluva:
     House  Tribute
1  Saluva     4200

Scene 4: Tungabhadra River Ferry The ferryman demands to know which merchants are second, seventh, and last in the scroll of traders. Only then will he row you across the river.

 Task: Use .iloc to get the 2nd, 7th, and last row. Then reverse the order of the DataFrame. (Concept: Position-based indexing + slicing tricks)

In [175]:
import pandas as pd

import pandas as pd

# Corrected mock DataFrame
data = {
    "Merchant": [f"Merchant_{i}" for i in range(1, 31)],
    "Item": [
        "Gold","Diamond","Gold","Horse","Spices","Gold","Diamond","Silk","Gold","Diamond",
        "Diamond","Diamond","Silk","Horse","Spices","Gold","Horse","Diamond","Silk","Horse",
        "Spices","Gold","Silk","Silk","Gold","Spices","Horse","Gold","Diamond","Gold"
    ],
    "Price": [
        2970,17552,30984,47965,26610,12397,38861,40106,29126,25728,
        15406,7470,28742,42008,38352,24878,9986,26779,10751,37558,
        21604,36990,35766,2419,35817,49043,20236,27408,35786,11673
    ]
}

bazaar_df = pd.DataFrame(data)
second = bazaar_df.iloc[1]     # 2nd row (index 1)
seventh = bazaar_df.iloc[6]    # 7th row (index 6)
last = bazaar_df.iloc[-1]      # last row

print("\n2nd Merchant:\n", second)
print("\n7th Merchant:\n", seventh)
print("\nLast Merchant:\n", last)

2nd Merchant:
 Merchant    Merchant_2
Item           Diamond
Price            17552
Name: 1, dtype: object

7th Merchant:
 Merchant    Merchant_7
Item           Diamond
Price            38861
Name: 6, dtype: object

Last Merchant:
 Merchant    Merchant_30
Item               Gold
Price             11673
Name: 29, dtype: object

Scene 5: Spice Ships at Goa Port A Portuguese captain offers you a CSV file of spices exported from Vijayanagara: quantity, type, and price. Some quantities are decimals, but you need integers.

Task: Import the CSV, display top 10 rows, and convert “Quantity” to integer type. (Concept: Import CSV + type conversion)

In [176]:
import pandas as pd

# Mount Google Drive

# Path to your CSV in Google Drivecsv
file_path = './vijayanagara_datasets/spices.csv'

# Read CSV
spices_df = pd.read_csv(file_path)

# Display top 10 rows
print("Top 10 rows:\n", spices_df.head(10))

# Convert Quantity to integer
spices_df["Quantity"] = spices_df["Quantity"].astype(int)
print("\nAfter converting 'Quantity' to integer:\n", spices_df.head(10))

Top 10 rows:
        Spice  Quantity  Price
0     Pepper      12.5    200
1   Cardamom       7.3    500
2      Clove       3.9    300
3   Cinnamon       5.0    400
4     Nutmeg       8.5    250
5   Turmeric      10.2    150
6    Saffron       1.5   1000
7  Coriander       9.0    120

After converting 'Quantity' to integer:
        Spice  Quantity  Price
0     Pepper        12    200
1   Cardamom         7    500
2      Clove         3    300
3   Cinnamon         5    400
4     Nutmeg         8    250
5   Turmeric        10    150
6    Saffron         1   1000
7  Coriander         9    120

Scene 6: Temple Treasury Records In Tirupati, temple priests reveal Excel files recording gold, land, and donations in multiple sheets. Each sheet tells only part of the story.

Task: Load all sheets into separate DataFrames, then concatenate them into one DataFrame.

Add a column indicating “Source” (Gold, Land, Donations).

(Concept: Import Excel + concat + adding a column)

In [ ]:
import pandas as pd

# Update the file path to include the full file name (including extension)
excel_file = "./vijayanagara_datasets/treasury.xlsx"

# Read all sheets into a dictionary of DataFrames
dfs = pd.read_excel(excel_file, sheet_name=None)

# List of source labels for each sheet (assuming the order is Gold, Land, Donations)
sources = ['Gold', 'Land', 'Donations']

# Empty list to hold all the DataFrames with the 'Source' column
df_list = []

# Iterate over the dictionary of DataFrames
for idx, (sheet_name, df) in enumerate(dfs.items()):
    # Add a new column 'Source' based on the sheet order
    df['Source'] = sources[idx]

    # Append the DataFrame to the list
    df_list.append(df)

# Concatenate all DataFrames into a single DataFrame
final_df = pd.concat(df_list, ignore_index=True)

# Display the final DataFrame
print(final_df.head())

Scene 7: Royal Granaries of Andhra Rice production scrolls show Area and Productivity, but some values seem exaggerated, hinting at errors.

 Task: Add a Total_Yield column = Area × Productivity. Identify outliers (> mean + 2*std) and filter them out.

  (Concept: Column operations + statistical filtering)

In [178]:
import pandas as pd

# Read the CSV file instead of Excel
df = pd.read_csv("./vijayanagara_datasets/granaries.csv")

# 1. Add Total_Yield = Area × Productivity
df["Total_Yield"] = df["Area"] * df["Productivity"]

# 2. Calculate mean and std of Total_Yield
mean_yield = df["Total_Yield"].mean()
std_yield = df["Total_Yield"].std()

# 3. Define threshold for outliers (mean + 2*std)
threshold = mean_yield + 2 * std_yield

# 4. Filter out rows where Total_Yield > threshold
filtered_df = df[df["Total_Yield"] <= threshold]

# Show results
print("With outliers:\n", df, "\n")
print("After removing outliers:\n", filtered_df.head())

With outliers:
         Region  Area  Productivity  Total_Yield
0       Andhra   146            47         6862
1    Karnataka   131            66         8646
2    TamilNadu    90            68         6120
3    Telangana    94            54         5076
4       Kerala   107            44         4708
5          Goa   134            61         8174
6  Maharashtra   115            60         6900
7       Odisha   123            48         5904
8        Bihar    83            48         3984
9        Assam   120            65         7800

After removing outliers:
       Region  Area  Productivity  Total_Yield
0     Andhra   146            47         6862
1  Karnataka   131            66         8646
2  TamilNadu    90            68         6120
3  Telangana    94            54         5076
4     Kerala   107            44         4708

Scene 8: Horse Traders of Hampi Arab horses, Persian horses, and fake horses crowd the marketplace. Only genuine Arab horses cost more than 2000 gold coins.

 Task: Filter rows where Price > 2000 & Origin != "Fake". Sort descending by price. (Concept: Filtering with conditions + sorting)

In [179]:
import pandas as pd

data = {
    "Trader": [f"Trader_{i}" for i in range(1, 11)],
    "HorseName": ["Arjun", "Bheema", "Chandra", "Drona", "Ekalvya",
                  "Feroz", "Gopal", "Hari", "Indra", "Jai"],
    "Origin": ["Arab", "Persian", "Fake", "Arab", "Arab",
               "Arab", "Persian", "Fake", "Arab", "Persian"],
    "Price": [3000, 2500, 500, 4000, 3500, 2800, 700, 3200, 2600, 3400]
}

horses_df = pd.DataFrame(data)
print("All horses in the bazaar:\n", horses_df)
# Filter genuine horses (Price > 2000, not Fake)
genuine_horses = horses_df.loc[
    (horses_df["Price"] > 2000) & (horses_df["Origin"] != "Fake")
]

# Sort descending by price
genuine_horses_sorted = genuine_horses.sort_values(by="Price", ascending=False)

print("\nGenuine horses (sorted by price):\n", genuine_horses_sorted)

All horses in the bazaar:
       Trader HorseName   Origin  Price
0   Trader_1     Arjun     Arab   3000
1   Trader_2    Bheema  Persian   2500
2   Trader_3   Chandra     Fake    500
3   Trader_4     Drona     Arab   4000
4   Trader_5   Ekalvya     Arab   3500
5   Trader_6     Feroz     Arab   2800
6   Trader_7     Gopal  Persian    700
7   Trader_8      Hari     Fake   3200
8   Trader_9     Indra     Arab   2600
9  Trader_10       Jai  Persian   3400

Genuine horses (sorted by price):
       Trader HorseName   Origin  Price
3   Trader_4     Drona     Arab   4000
4   Trader_5   Ekalvya     Arab   3500
9  Trader_10       Jai  Persian   3400
0   Trader_1     Arjun     Arab   3000
5   Trader_6     Feroz     Arab   2800
8   Trader_9     Indra     Arab   2600
1   Trader_2    Bheema  Persian   2500

Scene 9: Monsoon Scrolls of Vijayanagara Temple inscriptions record rainfall for irrigation tanks in different regions. The priests need the wettest regions for planning.

Task: Group by Region and compute mean, max, and min rainfall. Return the top 3 wettest regions. (Concept: GroupBy + multiple aggregation)

In [180]:
import pandas as pd
import pandas as pd

data = {
    "Region": [
        "Vijaynagara","Hampi","Anegundi","Kampli","Tungabhadra",
        "Badami","Gulbaraga","Bellary","Hospet","Anatapur"
    ],
    "Rainfall": [1079,1400,1506,1349,1102,1176,1571,1179,1241,1076]
}

rain_df = pd.DataFrame(data)
print("Temple Rainfall Records:\n", rain_df)

# Group by Region and aggregate
rain_stats = rain_df.groupby("Region")["Rainfall"].agg(["mean", "max", "min"]).reset_index()

# Sort by mean rainfall, pick top 3 regions
top_3_regions = rain_stats.sort_values(by="mean", ascending=False).head(3)

print("\nRainfall summary by region:\n", rain_stats)
print("\nTop 3 wettest regions:\n", top_3_regions)

Temple Rainfall Records:
         Region  Rainfall
0  Vijaynagara      1079
1        Hampi      1400
2     Anegundi      1506
3       Kampli      1349
4  Tungabhadra      1102
5       Badami      1176
6    Gulbaraga      1571
7      Bellary      1179
8       Hospet      1241
9     Anatapur      1076

Rainfall summary by region:
         Region    mean   max   min
0     Anatapur  1076.0  1076  1076
1     Anegundi  1506.0  1506  1506
2       Badami  1176.0  1176  1176
3      Bellary  1179.0  1179  1179
4    Gulbaraga  1571.0  1571  1571
5        Hampi  1400.0  1400  1400
6       Hospet  1241.0  1241  1241
7       Kampli  1349.0  1349  1349
8  Tungabhadra  1102.0  1102  1102
9  Vijaynagara  1079.0  1079  1079

Top 3 wettest regions:
       Region    mean   max   min
4  Gulbaraga  1571.0  1571  1571
1   Anegundi  1506.0  1506  1506
5      Hampi  1400.0  1400  1400

Scene 10: Diamond Merchants of Golconda Two ledgers record diamond trade separately. You must know total trade per region to unlock the merchant guild’s secret.

 Task: Concatenate the two DataFrames vertically. Add a column Ledger_Source. (Concept: Concatenate + source tracking)

In [181]:
import pandas as pd

# Ledger 1
data1 = {
    "Region": ["Vijayanagara", "Golconda", "Hampi", "Anegundi","Kampli"],
    "Diamonds": [50,70,60,40,55]
}
ledger1_df = pd.DataFrame(data1)

# Ledger 2
data2 = {
    "Region": ["Vijayanagara","Golconda", "Hampi", "Badami", "Bellary"],
    "Diamonds": [45,65,62,38,50]
}
ledger2_df = pd.DataFrame(data2)

print("Ledger 1:\n", ledger1_df, "\n")
print("Ledger 2:\n", ledger2_df)
# Add source column
ledger1_df["Ledger_Source"] = "Ledger 1"
ledger2_df["Ledger_Source"] = "Ledger 2"

# Concatenate vertically
combined = pd.concat([ledger1_df, ledger2_df], ignore_index=True)

print("\nCombined Ledgers:\n", combined)

Ledger 1:
          Region  Diamonds
0  Vijayanagara        50
1      Golconda        70
2         Hampi        60
3      Anegundi        40
4        Kampli        55

Ledger 2:
          Region  Diamonds
0  Vijayanagara        45
1      Golconda        65
2         Hampi        62
3        Badami        38
4       Bellary        50

Combined Ledgers:
          Region  Diamonds Ledger_Source
0  Vijayanagara        50      Ledger 1
1      Golconda        70      Ledger 1
2         Hampi        60      Ledger 1
3      Anegundi        40      Ledger 1
4        Kampli        55      Ledger 1
5  Vijayanagara        45      Ledger 2
6      Golconda        65      Ledger 2
7         Hampi        62      Ledger 2
8        Badami        38      Ledger 2
9       Bellary        50      Ledger 2

Scene 11: Scholar of Hampi A scholar presents two scrolls: one with student names, another with marks. Some students are missing in one scroll.

Task: Merge the DataFrames on Roll_Number.

Compare inner, left, and right joins. (Concept: Merge types)

In [182]:
import pandas as pd

# Scroll 1: Student details
df_names = pd.DataFrame({
    "Roll_Number": [101, 102, 103, 104,105],
    "Name": ["Ravi", "Anand", "Meera", "Sita","Hari"]
})

# Scroll 2: Marks details
df_marks = pd.DataFrame({
    "Roll_Number": [101, 102, 104,106,107],
    "Marks": [85,90,88,92,80]
})

print("Scroll 1 (Names):\n", df_names, "\n")
print("Scroll 2 (Marks):\n", df_marks, "\n")

# 1. INNER JOIN → only matching Roll_Number
inner_merge = pd.merge(df_names, df_marks, on="Roll_Number", how="inner")

# 2. LEFT JOIN → keep all from df_names, add marks if available
left_merge = pd.merge(df_names, df_marks, on="Roll_Number", how="left")

# 3. RIGHT JOIN → keep all from df_marks, add names if available
right_merge = pd.merge(df_names, df_marks, on="Roll_Number", how="right")

print("INNER JOIN:\n", inner_merge, "\n")
print("LEFT JOIN:\n", left_merge, "\n")
print("RIGHT JOIN:\n", right_merge, "\n")

Scroll 1 (Names):
    Roll_Number   Name
0          101   Ravi
1          102  Anand
2          103  Meera
3          104   Sita
4          105   Hari

Scroll 2 (Marks):
    Roll_Number  Marks
0          101     85
1          102     90
2          104     88
3          106     92
4          107     80

INNER JOIN:
    Roll_Number   Name  Marks
0          101   Ravi     85
1          102  Anand     90
2          104   Sita     88

LEFT JOIN:
    Roll_Number   Name  Marks
0          101   Ravi   85.0
1          102  Anand   90.0
2          103  Meera    NaN
3          104   Sita   88.0
4          105   Hari    NaN

RIGHT JOIN:
    Roll_Number   Name  Marks
0          101   Ravi     85
1          102  Anand     90
2          104   Sita     88
3          106    NaN     92
4          107    NaN     80

Scene 12: Caravanserai of Bijapur Merchants’ wool and cotton trade data share the same index, but some regions are missing records.

 Task: Join the DataFrames on index and fill missing values with 0.

  (Concept: Join + handling NaN)

In [183]:
import pandas as pd

# Caravanserai scroll 1: Wool trade
wool_df = pd.DataFrame({
    "Wool": [500, 450, 300,400,350]
}, index=["Vijaynagara", "Hampi","Anegundi","Kampli","Badami"])

# Caravanserai scroll 2: Cotton trade
cotton_df = pd.DataFrame({
    "Cotton": [600, 400, 320,380,300]
}, index=["Vijaynagara", "Hampi","Anegundi","Bellary","Hospet"])

print("Wool Data:\n", wool_df, "\n")
print("Cotton Data:\n", cotton_df, "\n")

# 1. Join on index (outer join by default keeps all regions)
trade_df = wool_df.join(cotton_df, how="outer")

# 2. Fill missing values with 0
trade_df = trade_df.fillna(0)

print("Final Trade Data (with missing = 0):\n", trade_df)

Wool Data:
              Wool
Vijaynagara   500
Hampi         450
Anegundi      300
Kampli        400
Badami        350

Cotton Data:
              Cotton
Vijaynagara     600
Hampi           400
Anegundi        320
Bellary         380
Hospet          300

Final Trade Data (with missing = 0):
               Wool  Cotton
Anegundi     300.0   320.0
Badami       350.0     0.0
Bellary        0.0   380.0
Hampi        450.0   400.0
Hospet         0.0   300.0
Kampli       400.0     0.0
Vijaynagara  500.0   600.0

Scene 13: Navaratri Festival Stalls Festival stalls sell rice, sweets, silk, and horses. You are asked to analyze only sweets and silk.

Task: Use .isin() to filter categories.

Compute total revenue for these categories. (Concept: Filtering with isin + aggregation)

In [184]:
import pandas as pd

# Festival stalls dataset
data = {
    "Category": [
        "Sweets","Horse","Horse","Horse","Sweets","Silk","Silk","Rice","Rice","Rice",
        "Silk","Silk","Horse","Horse","Rice","Silk","Rice","Silk","Rice","Silk"
    ],
    "Revenue": [
        4526,3121,2387,1647,1966,4998,790,3284,1279,669,
        2710,3434,4490,2134,3093,1751,2241,2901,1852,4590
    ]
}

df = pd.DataFrame(data)

# 1. Filter only Sweets and Silk
filtered_df = df[df["Category"].isin(["Sweets", "Silk"])]

# 2. Compute total revenue for these categories
total_revenue = filtered_df["Revenue"].sum()

print("Filtered Festival Stalls (Sweets & Silk):\n", filtered_df)
print("\nTotal Revenue from Sweets and Silk:", total_revenue)

Filtered Festival Stalls (Sweets & Silk):
    Category  Revenue
0    Sweets     4526
4    Sweets     1966
5      Silk     4998
6      Silk      790
10     Silk     2710
11     Silk     3434
15     Silk     1751
17     Silk     2901
19     Silk     4590

Total Revenue from Sweets and Silk: 27666

Scene 14: Census of Vijayanagara Officials record populations of provinces. Some provinces are missing entries.

 Task: Find the top 5 populated provinces.

  Compute their percentage contribution to total population. (Concept: Sorting + percentage calculation)

In [185]:
import pandas as pd

# Vijayanagara census dataset
data = {
    "Province": [
        "Vijayanagara","Hampi","Anegundi","Kampli","Badami",
        "Bellary","Hospet","Tungabhadra","Anantapur","Gulbarga"
    ],
    "Population": [
        1058578,1356381,644054,1493184,591633,
        818907,1391628,1334427,675255,1306462
    ]
}

df = pd.DataFrame(data)

# 1. Sort provinces by population descending
df_sorted = df.sort_values(by="Population", ascending=False)
print(" Population of  Provinces:\n", df_sorted)
# 2. Take top 5 populated provinces
# Take top 5 populated provinces and make a copy
top5 = df_sorted.head(5).copy()

# Compute percentage contribution
total_population = df["Population"].sum()
top5["Percentage"] = (top5["Population"] / total_population) * 100

# Display results
print("Top 5 Populated Provinces:\n", top5)

 Population of  Provinces:
        Province  Population
3        Kampli     1493184
6        Hospet     1391628
1         Hampi     1356381
7   Tungabhadra     1334427
9      Gulbarga     1306462
0  Vijayanagara     1058578
5       Bellary      818907
8     Anantapur      675255
2      Anegundi      644054
4        Badami      591633
Top 5 Populated Provinces:
       Province  Population  Percentage
3       Kampli     1493184   13.993559
6       Hospet     1391628   13.041815
1        Hampi     1356381   12.711493
7  Tungabhadra     1334427   12.505748
9     Gulbarga     1306462   12.243671

Scene 14: Census of Vijayanagara Officials record populations of provinces. Some provinces are missing entries.

 Task: Find the top 5 populated provinces.

  Compute their percentage contribution to total population. (Concept: Sorting + percentage calculation)

In [186]:
import pandas as pd

# Vijayanagara census dataset
data = {
    "Province": [
        "Vijayanagara","Hampi","Anegundi","Kampli","Badami",
        "Bellary","Hospet","Tungabhadra","Anantapur","Gulbarga"
    ],
    "Population": [
        1058578,1356381,644054,1493184,591633,
        818907,1391628,1334427,675255,1306462
    ]
}

df = pd.DataFrame(data)

# 1. Sort provinces by population descending
df_sorted = df.sort_values(by="Population", ascending=False)
print(" Population of  Provinces:\n", df_sorted)
# 2. Take top 5 populated provinces
# Take top 5 populated provinces and make a copy
top5 = df_sorted.head(5).copy()

# Compute percentage contribution
total_population = df["Population"].sum()
top5["Percentage"] = (top5["Population"] / total_population) * 100

# Display results
print("Top 5 Populated Provinces:\n", top5)

 Population of  Provinces:
        Province  Population
3        Kampli     1493184
6        Hospet     1391628
1         Hampi     1356381
7   Tungabhadra     1334427
9      Gulbarga     1306462
0  Vijayanagara     1058578
5       Bellary      818907
8     Anantapur      675255
2      Anegundi      644054
4        Badami      591633
Top 5 Populated Provinces:
       Province  Population  Percentage
3       Kampli     1493184   13.993559
6       Hospet     1391628   13.041815
1        Hampi     1356381   12.711493
7  Tungabhadra     1334427   12.505748
9     Gulbarga     1306462   12.243671

Scene 16: Court Poets of HampiRevenue from drama performances is recorded by year.

Task: Group by Year, compute total revenue, and

 find the highest-grossing drama per year using groupby().apply(). (Concept: GroupBy + apply)

In [187]:
import pandas as pd

# Court Poets dataset
data = {
    "Year": [1520, 1520, 1521, 1521, 1522, 1522],
    "Drama": ["Ramayana", "Mahabharata", "KrishnaLeela", "Bhagavata", "Raghuvamsha", "Kalidasa"],
    "Revenue": [5000, 6000, 7000, 6500, 4800, 5200]
}

df = pd.DataFrame(data)

# 1. Group by Year and compute total revenue
total_revenue_per_year = df.groupby("Year")["Revenue"].sum().reset_index(name="Total_Revenue")

# 2. Find highest-grossing drama per year
def highest_grossing(group):
    return group.loc[group["Revenue"].idxmax()]

top_drama_per_year = df.groupby("Year").apply(highest_grossing).reset_index(drop=True)

# Display results
print("Total Revenue per Year:\n", total_revenue_per_year)
print("\nHighest-Grossing Drama per Year:\n", top_drama_per_year)

Total Revenue per Year:
    Year  Total_Revenue
0  1520          11000
1  1521          13500
2  1522          10000

Highest-Grossing Drama per Year:
    Year         Drama  Revenue
0  1520   Mahabharata     6000
1  1521  KrishnaLeela     7000
2  1522      Kalidasa     5200

C:\Users\Dell\AppData\Local\Temp\ipykernel_13520\3388886814.py:19: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  top_drama_per_year = df.groupby("Year").apply(highest_grossing).reset_index(drop=True)

Scene 17: Royal Kitchen of Vijayanagara Feast recipe data contains missing Spices. You must ensure no feast is incomplete.

Task: Fill missing Spice with "Unknown".

 Forward-fill Quantity column. (Concept: fillna with method)

In [188]:
import pandas as pd

# Feast recipe dataset
data = {
    "Spice": ["Pepper","Cardamom","Clove","Cinnamon","Nutmeg","Turmeric","Saffron","Coriander", None],
    "Quantity": [12.5, 7.3, 3.9, 5.0, 8.5, 10.2, 1.5, 9.0, None],
    "Price": [200, 500, 300, 400, 250, 150, 1000, 120, 500]
}

df = pd.DataFrame(data)

# 1. Fill missing Spice with "Unknown"
df["Spice"] = df["Spice"].fillna("Unknown")

# 2. Forward-fill Quantity
df["Quantity"] = df["Quantity"].fillna(method="ffill")

# Display the cleaned dataset
print(df)

       Spice  Quantity  Price
0     Pepper      12.5    200
1   Cardamom       7.3    500
2      Clove       3.9    300
3   Cinnamon       5.0    400
4     Nutmeg       8.5    250
5   Turmeric      10.2    150
6    Saffron       1.5   1000
7  Coriander       9.0    120
8    Unknown       9.0    500

C:\Users\Dell\AppData\Local\Temp\ipykernel_13520\1141090316.py:16: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Quantity"] = df["Quantity"].fillna(method="ffill")

Scene 18: Temple Inscriptions Donation inscriptions are sometimes repeated by mistake.

 Task: Drop duplicates, reset index, and rename columns appropriately.

In [189]:
import pandas as pd

# Temple donation inscriptions dataset
data = {
    "Donor": ["Ravi", "Anand", "Ravi", "Meera", "Sita", "Hari"],
    "Amount": [500, 700, 500, 600, 550, 620]
}

df = pd.DataFrame(data)

# 1. Drop duplicate rows
df_clean = df.drop_duplicates()

# 2. Reset the index
df_clean = df_clean.reset_index(drop=True)

# 3. Rename columns (optional, make names title case)
df_clean = df_clean.rename(columns={"Donor": "Donor_Name", "Amount": "Donation_Amount"})

# Display the cleaned dataset
print(df_clean)

  Donor_Name  Donation_Amount
0       Ravi              500
1      Anand              700
2      Meera              600
3       Sita              550
4       Hari              620

Scene 19: Assembly of Data Scrolls After collecting 19 scrolls, you must merge them into one master dataset.

Task: Merge/concatenate all scrolls. Drop duplicates. Summarize Treasure_Value by Region.

 (Concept: Large-scale merging + cleanup + final aggregation)

In [190]:
import pandas as pd

# -----------------------------
# Step 1: Simulate 19 scrolls
# -----------------------------

# 1st scroll: Stall, Item, Price
scroll1 = pd.DataFrame({
    "Stall": range(1, 31),
    "Item": ["Gold","Diamond","Gold","Horse","Spices","Gold","Diamond","Silk","Gold","Diamond",
             "Diamond","Diamond","Silk","Horse","Spices","Gold","Horse","Diamond","Silk","Horse",
             "Spices","Gold","Silk","Silk","Gold","Spices","Horse","Gold","Diamond","Gold"],
    "Price": [29708,17552,30984,47965,26610,12397,38861,40106,29126,25728,
              15406,7470,28742,42008,38352,24878,9986,26779,10751,37558,
              21604,36990,35766,2419,35817,49043,20236,27408,35786,11673]
})

# 2nd scroll: Province, Population
scroll2 = pd.DataFrame({
    "Province": ["Vijayanagara","Hampi","Anegundi","Kampli","Badami","Bellary","Hospet",
                 "Tungabhadra","Anantapur","Gulbarga"],
    "Population": [1058578,1356381,644054,1493184,591633,818907,1391628,1334427,675255,1306462]
})

# 3rd scroll: Chariot schedule
scroll3 = pd.DataFrame({
    "Chariot": ["Sun","Moon","Star","Mars","Venus"],
    "Departure": ["08:00","09:00","10:30","12:00","13:30"],
    "Arrival": ["09:30","10:15","12:00","13:30","15:00"]
})

# 4th scroll: Region, Value (treasure)
scroll4 = pd.DataFrame({
    "Region": ["Vijayanagara","Hampi","Anegundi","Bellary","Hospet"],
    "Treasure_Value": [600,400,320,380,300]
})

# 5th scroll: Region, Diamonds
scroll5 = pd.DataFrame({
    "Region": ["Vijayanagara","Golconda","Hampi","Anegundi","Kampli"],
    "Diamonds": [50,70,60,40,55]
})

# 6th scroll: Region, Diamonds (another)
scroll6 = pd.DataFrame({
    "Region": ["Vijayanagara","Golconda","Hampi","Badami","Bellary"],
    "Diamonds": [45,65,62,38,50]
})

# 7th scroll: Donor, Amount
scroll7 = pd.DataFrame({
    "Donor": ["Ravi","Anand","Ravi","Meera","Sita","Hari"],
    "Amount": [500,700,500,600,550,620]
})

# 8th scroll: Year, Drama, Revenue
scroll8 = pd.DataFrame({
    "Year": [1520,1520,1521,1521,1522,1522],
    "Drama": ["Ramayana","Mahabharata","KrishnaLeela","Bhagavata","Raghuvamsha","Kalidasa"],
    "Revenue": [5000,6000,7000,6500,4800,5200]
})

# 9th scroll: House, Tribute
scroll9 = pd.DataFrame({
    "House": ["Sangama","Saluva","Tuluva","Aravidu","Vijaya","Rama","Hari","Deva","Vira","Chandra"],
    "Tribute": [5000,4200,4800,5100,4700,4500,4300,4600,4900,4400]
})

# 10th scroll: Dish, Spice, Quantity
scroll10 = pd.DataFrame({
    "Dish": ["Biryani","Biryani","Haleem","Pulao","Haleem"],
    "Spice": ["Saffron",None,"Cardamom","Clove",None],
    "Quantity": [5.0,None,3.0,4.0,None]
})

# 11th scroll: Region, Area, Productivity
scroll11 = pd.DataFrame({
    "Region": ["Andhra","Karnataka","TamilNadu","Telangana","Kerala","Goa","Maharashtra",
               "Odisha","Bihar","Assam"],
    "Area": [146,131,90,94,107,134,115,123,83,120],
    "Productivity": [47,66,68,54,44,61,60,48,48,65]
})

# 12th scroll: Name, Origin, Price
scroll12 = pd.DataFrame({
    "Name": ["Arjun","Bheem","Chandra","Drona","Ekalavya","Feroz","Gopal","Hari","Indra","Jai"],
    "Origin": ["Arab","Persian","Fake","Arab","Arab","Persian","Fake","Arab","Persian","Arab"],
    "Price": [3000,2500,500,4000,3500,2800,700,3200,2600,3900]
})

# 13th scroll: Roll, Marks
scroll13 = pd.DataFrame({
    "Roll": [101,102,104,106,107],
    "Marks": [85,90,88,92,80]
})

# 14th scroll: Region, Rainfall
scroll14 = pd.DataFrame({
    "Region": ["Vijayanagara","Hampi","Anegundi","Kampli","Tungabhadra",
               "Badami","Gulbarga","Bellary","Hospet","Anantapur"],
    "Rainfall": [1079,1400,1506,1349,1102,1176,1571,1179,1241,1076]
})

# 15th scroll: Spice, Quantity, Price
scroll15 = pd.DataFrame({
    "Spice": ["Pepper","Cardamom","Clove","Cinnamon","Nutmeg","Turmeric","Saffron","Coriander"],
    "Quantity": [12.5,7.3,3.9,5.0,8.5,10.2,1.5,9.0],
    "Price": [200,500,300,400,250,150,1000,120]
})

# 16th scroll: Stall, Category, Revenue
scroll16 = pd.DataFrame({
    "Stall": range(1,21),
    "Category": ["Sweets","Horse","Horse","Horse","Sweets","Silk","Silk","Rice","Rice","Rice",
                 "Silk","Silk","Horse","Horse","Rice","Silk","Rice","Silk","Rice","Silk"],
    "Revenue": [4526,3121,2387,1647,1966,4998,790,3284,1279,669,
                2710,3434,4490,2134,3093,1751,2241,2901,1852,4590]
})

# 17th scroll: Roll, Name
scroll17 = pd.DataFrame({
    "Roll": [101,102,103,104,105],
    "Name": ["Ravi","Anand","Meera","Sita","Hari"]
})

# 18th scroll: Region, Value
scroll18 = pd.DataFrame({
    "Region": ["Vijayanagara","Hampi","Anegundi","Kampli","Badami"],
    "Value": [500,450,300,400,350]
})

# 19th scroll: Donor, Amount
scroll19 = pd.DataFrame({
    "Donor": ["Ravi","Anand","Meera","Sita","Hari"],
    "Amount": [500,700,600,800,550]
})

# -----------------------------
# Step 2: Merge all scrolls
# -----------------------------
scrolls = [scroll1, scroll2, scroll3, scroll4, scroll5, scroll6, scroll7, scroll8, scroll9,
           scroll10, scroll11, scroll12, scroll13, scroll14, scroll15, scroll16, scroll17,
           scroll18, scroll19]

# Concatenate all scrolls into one master dataset
master_df = pd.concat(scrolls, ignore_index=True, sort=False)

# Drop duplicate rows and reset index
master_df = master_df.drop_duplicates().reset_index(drop=True)

# Step 3: Summarize Treasure_Value by Region
# Some scrolls use "Treasure_Value", some use "Value"
if "Treasure_Value" in master_df.columns:
    master_df["Treasure_Value"] = master_df["Treasure_Value"].fillna(0)
if "Value" in master_df.columns:
    if "Treasure_Value" not in master_df.columns:
        master_df["Treasure_Value"] = master_df["Value"].fillna(0)
    else:
        master_df["Treasure_Value"] += master_df["Value"].fillna(0)

# Group by Region
summary = master_df.groupby("Region", as_index=False)["Treasure_Value"].sum()

# -----------------------------
# Step 4: Show results
# -----------------------------
#print("Master Dataset (first 10 rows):\n", master_df.head(10))
print("\nTreasure Value Summary by Region:\n", summary)

Treasure Value Summary by Region:
           Region  Treasure_Value
0      Anantapur             0.0
1         Andhra             0.0
2       Anegundi           620.0
3          Assam             0.0
4         Badami           350.0
5        Bellary           380.0
6          Bihar             0.0
7            Goa             0.0
8       Golconda             0.0
9       Gulbarga             0.0
10         Hampi           850.0
11        Hospet           300.0
12        Kampli           400.0
13     Karnataka             0.0
14        Kerala             0.0
15   Maharashtra             0.0
16        Odisha             0.0
17     TamilNadu             0.0
18     Telangana             0.0
19   Tungabhadra             0.0
20  Vijayanagara          1100.0

Scene 20: Hidden Chamber of Hampi Finally, at the Virupaksha Temple, you decode the last riddle to reveal the treasure.

 Task: From the final dataset,

 compute: Region with maximum treasure Average treasure per category Treasure Key = sum of top 3 treasures

 Printing the treasure key unlocks the hidden wealth of Vijayanagara!

In [191]:
import pandas as pd

# Assume master_df already exists from Scene 19

# -----------------------------
# Step 1: Ensure Treasure_Value column exists
# -----------------------------
if "Treasure_Value" not in master_df.columns:
    if "Value" in master_df.columns:
        master_df["Treasure_Value"] = master_df["Value"].fillna(0)
    else:
        master_df["Treasure_Value"] = 0
else:
    master_df["Treasure_Value"] = master_df["Treasure_Value"].fillna(0)

# -----------------------------
# Step 2: Region with maximum treasure
# -----------------------------
region_max_treasure = master_df.groupby("Region", as_index=False)["Treasure_Value"].sum()
max_region = region_max_treasure.loc[region_max_treasure["Treasure_Value"].idxmax()]

print(f"Region with Maximum Treasure: {max_region['Region']} (Total: {max_region['Treasure_Value']})")

# -----------------------------
# Step 3: Average treasure per category
# -----------------------------
if "Category" in master_df.columns:
    avg_treasure_category = master_df.groupby("Category", as_index=False)["Treasure_Value"].mean()
    print("\nAverage Treasure per Category:\n", avg_treasure_category)
else:
    print("\nNo 'Category' column found for average treasure computation.")

# -----------------------------
# Step 4: Treasure Key = sum of top 3 treasures
# -----------------------------
top3_treasures = master_df["Treasure_Value"].nlargest(3)
treasure_key = top3_treasures.sum()
print(f"\nTreasure Key (sum of top 3 treasures): {treasure_key}")

Region with Maximum Treasure: Vijayanagara (Total: 1100.0)

Average Treasure per Category:
   Category  Treasure_Value
0    Horse             0.0
1     Rice             0.0
2     Silk             0.0
3   Sweets             0.0

Treasure Key (sum of top 3 treasures): 1550.0